/***************************************************************************************************
  * 文    件：BCSC.c    
  * 作    者：longwei
  * 编写日期：2012/5/24
  * 版    本：V1.0
  * 开 发 板：MSP430G2553 TI开发板
  * 修改时间：无 
  * 编 译 器: IAR.5.20
  *------------------------------------------------------------------------------------------------
  * 简    介： 
  *************************************************************************************************/  
/* 防止递归包含的定义-----------------------------------------------------------------------------*/
#ifndef __BCSC_H_
#define __BCSC_H_

#ifdef __cplusplus
 extern "C" {
#endif 
/* 包含 ------------------------------------------------------------------------------------------*/
#include  <msp430g2553.h>
#include "stdint.h"
/* 出口类型 --------------------------------------------------------------------------------------*/
/*-------------------------------DCOCLK-----------------------------------------------------------*/
typedef enum 
{	
	_1MHZ=0,
	_8MHZ  ,
    _12MHZ ,
    _16MHZ ,
}DCO_Bool;
/*-------------------------------ACLK时钟源-------------------------------------------------------*/
typedef enum 
{	
	LF=0,//Low_frequency mode
	HF  ,//High_frequency mode
    VLO ,//VLOCLK
}ACLK_Bool;
/*--------------------------------MCLK------------------------------------------------------------*/
typedef enum 
{	
	M_DCO_CLK=0,
	M_XT2_CLK  ,
    M_LF_CLK   ,
}MCLK_Bool;
/*-------------------------------SMCLK------------------------------------------------------------*/
typedef enum 
{	
	SM_DCO_CLK=0,
	SM_XT2_CLK  ,
}SMCLK_Bool;
/*-------------------------------ACLK 分频--------------------------------------------------------*/
#define ACLK_DIV_mask 0xCF
//以下在msp430x21x2.h中已经宏定义了
//#define DIVA_0              (0x00)   /* ACLK Divider 0: /1 */
//#define DIVA_1              (0x10)   /* ACLK Divider 1: /2 */
//#define DIVA_2              (0x20)   /* ACLK Divider 2: /4 */
//#define DIVA_3              (0x30)   /* ACLK Divider 3: /8 */
/*-------------------------------MCLK 分频--------------------------------------------------------*/
#define MCLK_DIV_mask 0xCF
//#define DIVM_0              (0x00)   /* MCLK Divider 0: /1 */
//#define DIVM_1              (0x10)   /* MCLK Divider 1: /2 */
//#define DIVM_2              (0x20)   /* MCLK Divider 2: /4 */
//#define DIVM_3              (0x30)   /* MCLK Divider 3: /8 */
/*------------------------------SMCLK 分频--------------------------------------------------------*/
#define SMCLK_DIV_mask 0xF9
//以下在msp430x21x2.h中已经宏定义了
//#define DIVS_0              (0x00)   /* SMCLK Divider 0: /1 */
//#define DIVS_1              (0x02)   /* SMCLK Divider 1: /2 */
//#define DIVS_2              (0x04)   /* SMCLK Divider 2: /4 */
//#define DIVS_3              (0x06)   /* SMCLK Divider 3: /8 */
/* 出口常量---------------------------------------------------------------------------------------*/


/* 出口宏-----------------------------------------------------------------------------------------*/


/*出口函数模型------------------------------------------------------------------------------------*/
void DCOCLK_Set(DCO_Bool DCO_MHz);
void ACLK_Set(ACLK_Bool ACLK_S,uint8_t ACLK_DIV);
void MCLK_Set(MCLK_Bool MCLK_S,uint8_t MCLK_DIV);
void SMCLK_Set(SMCLK_Bool SMCLK_S,uint8_t SMCLK_DIV); 

#ifdef __cplusplus
}
#endif

#endif 

/******************* (C) 版权 2012 longwei *****文件结束*******************************************/
