/***************************************************************************************************
  * 文    件：mian.c    
  * 作    者：longwei
  * 编写日期：2012/524
  * 版    本：V1.0
  * 开 发 板：MSP430G2553 TI开发板
  * 修改时间：无 
  * 编 译 器: IAR.5.20
  *-------------------------------------------------------------------------------------------------
  * 简    介：
  * 参    考:    
  *************************************************************************************************/  
/* 防止递归包含的定义-----------------------------------------------------------------------------*/
#ifndef __DELAY_H_
#define __DELAY_H_

#ifdef __cplusplus
 extern "C" {
#endif 

/* 包含 ------------------------------------------------------------------------------------------*/
#include  <msp430g2553.h>
#include "stdint.h"
/* 出口宏-----------------------------------------------------------------------------------------*/
#define Dealy_ms_Base  0xC80 //MCLK=16Mhz
//#define Dealy_ms_Base  0x640 //MCLK=8Mhz
//#define Dealy_ms_Base  0x320 //MCLK=4Mhz
//#define Dealy_ms_Base  0x190 //MCLK=2Mhz
//#define Dealy_ms_Base  0xC8 //MCLK=1Mhz
   
#define Dealy_us_Base  0x08 //MCLK=16Mhz
//#define Dealy_us_Base  0x04 //MCLK=8Mhz
//#define Dealy_us_Base  0x02 //MCLK=4Mhz    
/*出口函数模型------------------------------------------------------------------------------------*/
void delay_ms(uint16_t ms);
void delay_us(uint16_t us);

#ifdef __cplusplus
}
#endif

#endif 

/******************* (C) 版权 2012 longwei *****文件结束*******************************************/
